Repository: qianmuyan001/assignment-app
Catalog: native/windows/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# MainWindow.Title
source: Assignments
zh_cn: 作业管理

# AppWindowTitle
source: Assignments
zh_cn: 作业管理

# OrganizationWindowTitle
source: Courses, projects & tags
zh_cn: 课程、项目与标签

# AppName.Text
source: Assignments
zh_cn: 作业管理

# AppSubtitle.Text
source: Local task workspace
zh_cn: 本地任务工作区

# NavigationStyleLabel.Text
source: Compact navigation
zh_cn: 紧凑导航

# NavAll.Content
source: All Assignments
zh_cn: 全部作业

# NavToday.Content
source: Today
zh_cn: 今天

# NavWeek.Content
source: This Week
zh_cn: 本周

# NavOverdue.Content
source: Overdue
zh_cn: 已逾期

# NavCompleted.Content
source: Completed
zh_cn: 已完成

# NavSources.Content
source: Sources
zh_cn: 来源

# PageTitle.Text
source: All Assignments
zh_cn: 全部作业

# AddAssignmentButton.Content
source: Add assignment
zh_cn: 添加作业

# ManageOrganizationButton.Content
source: Courses & tags
zh_cn: 课程与标签

# ErrorBar.Title
source: Could not load assignments
zh_cn: 无法加载作业

# SearchBox.PlaceholderText
source: Search title, course, or description
zh_cn: 搜索标题、课程或描述

# StatusFilterBox.Header
source: Status
zh_cn: 状态

# StatusAll.Content
source: All statuses
zh_cn: 全部状态

# StatusTodo.Content
source: To do
zh_cn: 待办

# StatusInProgress.Content
source: In progress
zh_cn: 进行中

# StatusDone.Content
source: Done
zh_cn: 已完成

# CourseFilterBox.Header
source: Course
zh_cn: 课程

# PriorityFilterBox.Header
source: Priority
zh_cn: 优先级

# PriorityAll.Content
source: All priorities
zh_cn: 全部优先级

# PriorityHigh.Content
source: High
zh_cn: 高

# PriorityMedium.Content
source: Medium
zh_cn: 中

# PriorityLow.Content
source: Low
zh_cn: 低

# SortBox.Header
source: Sort
zh_cn: 排序

# SortDueDate.Content
source: Due date
zh_cn: 截止日期

# SortPriority.Content
source: Priority
zh_cn: 优先级

# ClearFiltersButton.Content
source: Clear
zh_cn: 清除

# OpenSourceLinkButton.Content
source: Open source link
zh_cn: 打开来源链接

# EditAssignmentButton.Content
source: Edit
zh_cn: 编辑

# MarkDoneButton.Content
source: Mark done
zh_cn: 标记完成

# EmptyStateTitle.Text
source: No assignments here
zh_cn: 这里还没有作业

# EmptyStateMessage.Text
source: Add an assignment or change the filters.
zh_cn: 添加作业或调整筛选条件。

# LoadingAssignments.Text
source: Loading assignments…
zh_cn: 正在加载作业…

# SourceConnectorTitle.Text
source: Secure Source Connector
zh_cn: 安全来源连接器

# SourceConnectorSubtitle.Text
source: Sign in first, then let the local model extract assignments.
zh_cn: 先登录，再让本地模型提取作业。

# LocalOnly.Text
source: Local only
zh_cn: 仅限本机

# SourceNameBox.PlaceholderText
source: Source name · e.g. Canvas
zh_cn: 来源名称，例如 Canvas

# CourseHintBox.PlaceholderText
source: Course hint · optional
zh_cn: 课程提示（可选）

# InteractiveLogin.Content
source: Interactive login
zh_cn: 交互式登录

# CredentialFill.Content
source: Credential Locker fill
zh_cn: 凭据管理器填充

# OpenAddressButton.Content
source: Open
zh_cn: 打开

# CredentialButton.Content
source: Credential
zh_cn: 凭据

# BrowserTitle.Text
source: No page loaded
zh_cn: 尚未加载页面

# AutoFillToggle.Header
source: Auto-fill exact origin
zh_cn: 为此来源自动填充

# ScanButton.Content
source: Scan current page
zh_cn: 扫描当前页面

# SettingsTitle.Text
source: Settings
zh_cn: 设置

# NotificationsTitle.Text
source: System notifications
zh_cn: 系统通知

# NotificationStatusText.Text
source: Checking Windows settings…
zh_cn: 正在检查 Windows 设置…

# RefreshNotificationButton.Content
source: Refresh status
zh_cn: 刷新状态

# OpenNotificationSettingsButton.Content
source: Open notification settings
zh_cn: 打开通知设置

# SendTestNotificationButton.Content
source: Send test reminder
zh_cn: 发送测试提醒

# NotificationHelp.Text
source: If notifications are blocked, tasks and reminder records continue to work normally.
zh_cn: 即使通知被阻止，任务和提醒记录仍可正常使用。

# TaskDisplayTitle.Text
source: Task display
zh_cn: 任务显示

# DisplayModeBox.Header
source: Mode
zh_cn: 模式

# DisplaySimple.Content
source: Simple
zh_cn: 简易

# DisplayProfessional.Content
source: Professional
zh_cn: 专业

# DisplayModeHelp.Text
source: Simple shows the title, course, due time, and status. Professional also shows the description, priority, and source link. Hidden fields are never cleared.
zh_cn: 简易模式显示标题、课程、截止时间和状态；专业模式还会显示描述、优先级和来源链接。隐藏字段不会被清空。

# ThemeBox.Header
source: Appearance
zh_cn: 外观

# ThemeSystem.Content
source: Use system setting
zh_cn: 使用系统设置

# ThemeLight.Content
source: Light
zh_cn: 浅色

# ThemeDark.Content
source: Dark
zh_cn: 深色

# LanguageSectionTitle.Text
source: Language
zh_cn: 语言

# LanguageBox.Header
source: Application language
zh_cn: 应用语言

# LanguageChinese.Content
source: Simplified Chinese
zh_cn: 简体中文

# LanguageHelp.Text
source: The interface updates immediately. Task data is not changed.
zh_cn: 界面会立即更新，任务数据不会发生变化。

# LocalAiTitle.Text
source: Local AI
zh_cn: 本地 AI

# AiEndpointBox.Header
source: Loopback endpoint
zh_cn: 回环地址

# CheckAiButton.Content
source: Check connection
zh_cn: 检查连接

# AiStatusText.Text
source: Not checked
zh_cn: 尚未检查

# AiHelp.Text
source: Only localhost and loopback IP addresses are accepted.
zh_cn: 仅接受 localhost 和回环 IP 地址。

# LocalDataTitle.Text
source: Local data
zh_cn: 本地数据

# LocalDataHelp.Text
source: Task data stays in SQLite on this PC. Versioned migrations create a recoverable backup before changing an existing database.
zh_cn: 任务数据保存在本机的 SQLite 数据库中。版本迁移会在更改现有数据库前创建可恢复的备份。

# PrivacyTitle.Text
source: Privacy
zh_cn: 隐私

# PrivacyPasswords.Text
source: • Passwords stay in Windows Credential Locker
zh_cn: • 密码保存在 Windows 凭据管理器中

# PrivacyContent.Text
source: • Course content stays on this PC
zh_cn: • 课程内容保留在此电脑上

# PrivacyBrowser.Text
source: • The local model cannot control the login browser
zh_cn: • 本地模型无法控制登录浏览器

# TaskEditorDialog.Title
source: Assignment
zh_cn: 作业

# TaskEditorDialog.PrimaryButtonText
source: Save
zh_cn: 保存

# TaskEditorDialog.CloseButtonText
source: Cancel
zh_cn: 取消

# EditorTitleBox.Header
source: Title
zh_cn: 标题

# EditorTitleBox.PlaceholderText
source: What needs to be done?
zh_cn: 需要完成什么？

# EditorCourseBox.Header
source: Course
zh_cn: 课程

# EditorCourseBox.PlaceholderText
source: Course name (type, or pick below)
zh_cn: 输入课程名称，或从下方选择

# EditorCoursePicker.Header
source: Pick an existing course
zh_cn: 选择已有课程

# EditorProjectPicker.Header
source: Project
zh_cn: 项目

# EditorTags.Text
source: Tags
zh_cn: 标签

# EditorHasDueDate.Content
source: Set a due date and time
zh_cn: 设置截止日期和时间

# EditorDueDate.Header
source: Due date
zh_cn: 截止日期

# EditorDueTime.Header
source: Due time
zh_cn: 截止时间

# EditorStatusBox.Header
source: Status
zh_cn: 状态

# EditorDescriptionBox.Header
source: Description
zh_cn: 描述

# EditorDescriptionBox.PlaceholderText
source: Notes, requirements, or context
zh_cn: 备注、要求或相关背景

# EditorPriorityBox.Header
source: Priority
zh_cn: 优先级

# EditorLinkBox.Header
source: Source link
zh_cn: 来源链接

# EditorSubtasks.Text
source: Subtasks
zh_cn: 子任务

# EditorNewSubtask.PlaceholderText
source: Add a subtask
zh_cn: 添加子任务

# EditorAddSubtaskButton.Content
source: Add
zh_cn: 添加

# EditorReminders.Text
source: Reminders
zh_cn: 提醒

# EditorReminderDate.Header
source: Date
zh_cn: 日期

# EditorReminderTime.Header
source: Time
zh_cn: 时间

# EditorAddReminderButton.Content
source: Add reminder
zh_cn: 添加提醒

# EditorAttachments.Text
source: Attachments
zh_cn: 附件

# EditorAddAttachmentButton.Content
source: Add attachment…
zh_cn: 添加附件…

# EditorModeHelp.Text
source: Professional fields are hidden in simple mode but their saved values are preserved.
zh_cn: 简易模式会隐藏专业字段，但不会删除其已保存的内容。

# OrganizationWindow.Title
source: Courses, projects & tags
zh_cn: 课程、项目与标签

# OrganizationTitle.Text
source: Organization
zh_cn: 组织管理

# CoursesTab.Header
source: Courses
zh_cn: 课程

# ProjectsTab.Header
source: Projects
zh_cn: 项目

# TagsTab.Header
source: Tags
zh_cn: 标签

# NameField.Header
source: Name
zh_cn: 名称

# ColorField.Header
source: Color (#RRGGBB)
zh_cn: 颜色 (#RRGGBB)

# TeacherField.Header
source: Teacher
zh_cn: 教师

# SemesterField.Header
source: Semester
zh_cn: 学期

# ArchivedField.Content
source: Archived
zh_cn: 已归档

# CourseField.Header
source: Course
zh_cn: 课程

# DescriptionField.Header
source: Description
zh_cn: 描述

# ProjectStatusField.Header
source: Status
zh_cn: 状态

# ProjectActive.Content
source: Active
zh_cn: 进行中

# ProjectOnHold.Content
source: On hold
zh_cn: 已暂停

# ProjectCompleted.Content
source: Completed
zh_cn: 已完成

# ProjectArchived.Content
source: Archived
zh_cn: 已归档

# SaveCourseButton.Content
source: Save
zh_cn: 保存

# NewCourseButton.Content
source: New
zh_cn: 新建

# DeleteCourseButton.Content
source: Delete
zh_cn: 删除

# SaveProjectButton.Content
source: Save
zh_cn: 保存

# NewProjectButton.Content
source: New
zh_cn: 新建

# DeleteProjectButton.Content
source: Delete
zh_cn: 删除

# SaveTagButton.Content
source: Save
zh_cn: 保存

# NewTagButton.Content
source: New
zh_cn: 新建

# DeleteTagButton.Content
source: Delete
zh_cn: 删除

source: Settings
zh_cn: 设置

source: All courses
zh_cn: 全部课程

source: (No project)
zh_cn: （无项目）

# CustomCourse
source: (Custom — type above)
zh_cn: （自定义，请在上方输入）

# DynamicStatusTodo
source: To do
zh_cn: 待办

# DynamicStatusInProgress
source: In progress
zh_cn: 进行中

# DynamicStatusDone
source: Done
zh_cn: 已完成

source: No description
zh_cn: 暂无描述

# PriorityDisplay
source: {0} priority
zh_cn: {0}优先级

# DynamicPriorityLow
source: Low
zh_cn: 低

# DynamicPriorityMedium
source: Medium
zh_cn: 中

# DynamicPriorityHigh
source: High
zh_cn: 高

source: No due date
zh_cn: 无截止日期

source: All day
zh_cn: 全天

# AssignmentCount
source: {0} assignments
zh_cn: {0} 项作业

# AssignmentCountOne
source: 1 assignment
zh_cn: 1 项作业

source: Show navigation labels
zh_cn: 显示导航文字

source: Use compact navigation
zh_cn: 使用紧凑导航

# AddAssignmentTitle
source: Add assignment
zh_cn: 添加作业

# EditAssignmentTitle
source: Edit assignment
zh_cn: 编辑作业

source: Save
zh_cn: 保存

source: Cancel
zh_cn: 取消

source: Delete
zh_cn: 删除

source: Edit
zh_cn: 编辑

source: Remove
zh_cn: 移除

source: Open
zh_cn: 打开

source: Export
zh_cn: 导出

source: Enable
zh_cn: 启用

source: Disable
zh_cn: 停用

source: Edit time
zh_cn: 编辑时间

source: OK
zh_cn: 确定

source: Organization
zh_cn: 组织管理

# NoticeTitle
source: Assignments
zh_cn: 作业管理

# NotificationTestTitle
source: Assignment App test reminder
zh_cn: 作业管理测试提醒

# NotificationTestMessage
source: Windows scheduled notifications and activation are working.
zh_cn: Windows 定时通知和点击激活功能正常。

# NotificationTaskMessage
source: {0} · Due {1}
zh_cn: {0} · 截止 {1}

# NotificationOpenButton
source: Open Assignment App
zh_cn: 打开作业管理

# NotificationAllowed
source: Allowed
zh_cn: 已允许

# NotificationRegistered
source: Registered with Windows
zh_cn: 已向 Windows 注册

# NotificationUnavailable
source: Unavailable
zh_cn: 不可用

# NotificationUnavailableWindows
source: Unavailable on this Windows installation
zh_cn: 此 Windows 系统不可用

# NotificationDisabledApp
source: Disabled for Assignment App
zh_cn: 已为作业管理关闭

# NotificationDisabledUser
source: Disabled for this Windows user
zh_cn: 当前 Windows 用户已关闭

# NotificationDisabledPolicy
source: Disabled by Group Policy
zh_cn: 已被组策略关闭

# NotificationDisabledManifest
source: Disabled by app manifest
zh_cn: 已被应用清单关闭

# NotificationBlockedApp
source: Notifications are disabled for Assignment App
zh_cn: 作业管理的通知已关闭

# NotificationBlockedUser
source: Notifications are disabled for this Windows user
zh_cn: 当前 Windows 用户的通知已关闭

# NotificationBlockedPolicy
source: Notifications are disabled by Group Policy
zh_cn: 通知已被组策略关闭

# NotificationBlockedManifest
source: Notifications are disabled by the app manifest
zh_cn: 通知已被应用清单关闭

# NotificationUnknown
source: Notification availability could not be determined
zh_cn: 无法确定通知是否可用

# NotificationFailure
source: Last operation failed ({0}, 0x{1})
zh_cn: 上次操作失败（{0}，0x{1}）

# SettingsLoadError
source: Settings could not be loaded. Defaults are being used.
zh_cn: 无法加载设置，正在使用默认值。

# SchemaVersion
source: Schema version {0}
zh_cn: 数据库结构版本 {0}

# SchemaVersionBackup
source: Schema version {0} · migration backup: {1}
zh_cn: 数据库结构版本 {0} · 迁移备份：{1}

# DatabaseOpenError
source: The local database could not be opened safely. No task changes will be written. Check the message and restore from the migration backup if one is listed.
zh_cn: 无法安全打开本地数据库，因此不会写入任务更改。请检查错误信息；如果列出了迁移备份，请从备份恢复。

# AssignmentsLoadError
source: Assignments could not be loaded.
zh_cn: 无法加载作业。

# FiltersApplyError
source: The current filters could not be applied.
zh_cn: 无法应用当前筛选条件。

source: No matching assignments
zh_cn: 没有匹配的作业

source: No assignments here
zh_cn: 这里还没有作业

# ClearFiltersForTasks
source: Clear or change the filters to see more tasks.
zh_cn: 清除或更改筛选条件以查看更多任务。

# NoTasksToday
source: No tasks are due today.
zh_cn: 今天没有到期任务。

# NoTasksWeek
source: No tasks are due in this calendar week.
zh_cn: 本周没有到期任务。

# NothingOverdue
source: Nothing is overdue.
zh_cn: 没有逾期任务。

# CompletedTasksHere
source: Completed tasks will appear here.
zh_cn: 已完成的任务会显示在这里。

# AddAssignmentGetStarted
source: Add an assignment to get started.
zh_cn: 添加一项作业以开始使用。

# NavTodayTitle
source: Today
zh_cn: 今天

# NavWeekTitle
source: This Week
zh_cn: 本周

# NavOverdueTitle
source: Overdue
zh_cn: 已逾期

# NavCompletedTitle
source: Completed
zh_cn: 已完成

# NavAllTitle
source: All Assignments
zh_cn: 全部作业

# DatabaseUnavailableAdd
source: The database is unavailable, so the assignment cannot be added.
zh_cn: 数据库不可用，无法添加作业。

# DeleteAssignmentTitle
source: Delete this assignment?
zh_cn: 删除这项作业？

# DeleteAssignmentGeneric
source: This removes it from the local assignment database.
zh_cn: 这会将其从本地作业数据库中移除。

# DeleteAssignmentNamed
source: “{0}” will be permanently removed from the local database.
zh_cn: “{0}”将从本地数据库中永久删除。

# DatabaseUnavailableChanges
source: The database is unavailable. No changes were written.
zh_cn: 数据库不可用，未写入任何更改。

# AssignmentSaveError
source: The assignment change could not be saved.
zh_cn: 无法保存作业更改。

# TestReminderScheduled
source: Allowed · Test reminder scheduled for five seconds from now
zh_cn: 已允许 · 测试提醒将在五秒后显示

# AttachmentFilesMissing
source: Some attachment files are missing from local storage: {0}
zh_cn: 本地存储中缺少部分附件文件：{0}

# AttachmentReconcileError
source: Attachment files could not be reconciled. Tasks remain available, but attachment cleanup needs attention.
zh_cn: 无法核对附件文件。任务仍可使用，但附件清理需要处理。

# InvalidSourceLink
source: This assignment does not have a valid http or https source link.
zh_cn: 此作业没有有效的 http 或 https 来源链接。

# OpenSourceLinkError
source: Windows could not open the source link.
zh_cn: Windows 无法打开来源链接。

# AssignmentTagsSaveError
source: The assignment tags could not be saved.
zh_cn: 无法保存作业标签。

# OrganizationUnavailable
source: The database is unavailable, so organization settings cannot be opened.
zh_cn: 数据库不可用，无法打开组织设置。

# SettingsSaveError
source: The setting could not be saved for the next launch.
zh_cn: 无法保存设置供下次启动使用。

# BlockedNonWebNavigation
source: Blocked a non-web navigation request.
zh_cn: 已阻止非网页导航请求。

source: Web page
zh_cn: 网页

# OpenHttpsLoginFirst
source: Open the HTTPS login page first.
zh_cn: 请先打开 HTTPS 登录页面。

source: Username or email
zh_cn: 用户名或电子邮箱

source: Password
zh_cn: 密码

# ExactHttpsOrigin
source: Exact HTTPS origin: {0}
zh_cn: 精确 HTTPS 来源：{0}

# CredentialLockerHelp
source: Stored in Windows Credential Locker. Filling never submits the form.
zh_cn: 凭据保存在 Windows 凭据管理器中。自动填充不会提交表单。

source: Saved credential
zh_cn: 已保存的凭据

source: Fill existing
zh_cn: 填充已有凭据

# OpenLoginFirst
source: Open a login page first.
zh_cn: 请先打开登录页面。

# NoCredentialSaved
source: No credential is saved for {0}.
zh_cn: 没有为 {0} 保存凭据。

# CredentialFilled
source: Username and password were filled. Review the page before signing in.
zh_cn: 用户名和密码已填充，请检查页面后再登录。

source: Reading locally…
zh_cn: 正在本地读取…

source: Scan current page
zh_cn: 扫描当前页面

# NoAssignmentsFoundOnPage
source: The local model found no assignments on this page.
zh_cn: 本地模型未在此页面找到作业。

# ReviewCandidates
source: Review {0} assignment candidates
zh_cn: 检查 {0} 个作业候选项

source: Add selected
zh_cn: 添加所选项

# ImportedAssignmentsSaveError
source: Imported assignments could not be saved.
zh_cn: 无法保存导入的作业。

# AssignmentsImported
source: Added {0} assignments. Duplicates were skipped.
zh_cn: 已添加 {0} 项作业，重复项已跳过。

# AiReady
source: Ready
zh_cn: 已就绪

# AiOffline
source: Offline
zh_cn: 离线

source: Web
zh_cn: 网页

# EditorAttachmentFilesMissing
source: Some attachment files are missing: {0}
zh_cn: 缺少部分附件文件：{0}

# MarkSubtaskComplete
source: Mark {0} complete
zh_cn: 将子任务“{0}”标记为完成

# EditSubtask
source: Edit subtask {0}
zh_cn: 编辑子任务“{0}”

# RemoveSubtask
source: Remove subtask {0}
zh_cn: 移除子任务“{0}”

# EditReminder
source: Edit reminder {0}
zh_cn: 编辑提醒 {0}

# ToggleReminder
source: {0} reminder {1}
zh_cn: {0}提醒 {1}

# RemoveReminder
source: Remove reminder {0}
zh_cn: 移除提醒 {0}

# AttachmentSize
source: {0} ({1} bytes)
zh_cn: {0}（{1} 字节）

# AttachmentUnavailable
source: {0} — local file missing or unsafe
zh_cn: {0} — 本地文件缺失或不安全

# OpenAttachment
source: Open attachment {0}
zh_cn: 打开附件 {0}

# ExportAttachment
source: Export attachment {0}
zh_cn: 导出附件 {0}

# RemoveAttachment
source: Remove attachment {0}
zh_cn: 移除附件 {0}

# ReminderRepeats
source: · repeats {0}
zh_cn: · 重复规则：{0}

# ReminderDisabled
source: (disabled)
zh_cn: （已停用）

# SubtaskAddError
source: The subtask could not be added: {0}
zh_cn: 无法添加子任务：{0}

# SubtaskUpdateError
source: The subtask could not be updated: {0}
zh_cn: 无法更新子任务：{0}

# SubtaskRemoveError
source: The subtask could not be removed: {0}
zh_cn: 无法移除子任务：{0}

source: Title
zh_cn: 标题

source: Subtask title
zh_cn: 子任务标题

source: Save subtask title
zh_cn: 保存子任务标题

source: Cancel subtask title edit
zh_cn: 取消编辑子任务标题

source: Edit subtask title
zh_cn: 编辑子任务标题

# ReminderSavedNotificationError
source: The reminder was saved, but Windows did not schedule the notification. {0}
zh_cn: 提醒已保存，但 Windows 未能安排通知。{0}

# ReminderAddError
source: The reminder could not be added: {0}
zh_cn: 无法添加提醒：{0}

# ReminderRemovedNotificationError
source: The reminder was removed, but its Windows notification could not be verified. {0}
zh_cn: 提醒已移除，但无法验证其 Windows 通知状态。{0}

# ReminderRemoveError
source: The reminder could not be removed: {0}
zh_cn: 无法移除提醒：{0}

source: Date
zh_cn: 日期

source: Time
zh_cn: 时间

source: Reminder date
zh_cn: 提醒日期

source: Reminder time
zh_cn: 提醒时间

source: Save reminder time
zh_cn: 保存提醒时间

source: Cancel reminder time edit
zh_cn: 取消编辑提醒时间

source: Edit reminder time
zh_cn: 编辑提醒时间

# ReminderTimeSavedNotificationError
source: The reminder time was saved, but Windows notification state could not be verified. {0}
zh_cn: 提醒时间已保存，但无法验证 Windows 通知状态。{0}

# ReminderUpdateError
source: The reminder could not be updated: {0}
zh_cn: 无法更新提醒：{0}

# ReminderUpdatedNotificationError
source: The reminder was updated, but Windows notification state could not be verified. {0}
zh_cn: 提醒已更新，但无法验证 Windows 通知状态。{0}

# TaskNotificationRefreshError
source: The task was updated, but Windows notifications could not be refreshed.
zh_cn: 任务已更新，但无法刷新 Windows 通知。

# FilePickerOpenError
source: The file picker could not be opened: {0}
zh_cn: 无法打开文件选择器：{0}

# AttachmentAddError
source: The attachment could not be added: {0}
zh_cn: 无法添加附件：{0}

# AttachmentRemoveError
source: The attachment could not be removed: {0}
zh_cn: 无法移除附件：{0}

# AttachmentNoOpenApp
source: Windows could not find an app to open this attachment.
zh_cn: Windows 找不到可打开此附件的应用。

# AttachmentOpenError
source: The attachment could not be opened: {0}
zh_cn: 无法打开附件：{0}

source: Attachment
zh_cn: 附件

# AttachmentExportError
source: The attachment could not be exported: {0}
zh_cn: 无法导出附件：{0}

# TitleCourseRequired
source: Title and course are required.
zh_cn: 标题和课程为必填项。

# TitleCourseTooLong
source: Title or course is too long.
zh_cn: 标题或课程名称过长。

# SourceLinkHttpOnly
source: Source link must use http or https.
zh_cn: 来源链接必须使用 http 或 https。

# DueDateTimeRequired
source: Due date and time are required.
zh_cn: 必须填写截止日期和时间。

source: (No course)
zh_cn: （无课程）

# CourseNameRequired
source: A course name is required.
zh_cn: 必须填写课程名称。

# CourseSaveError
source: The course could not be saved: {0}
zh_cn: 无法保存课程：{0}

# CourseDeleteError
source: The course could not be deleted: {0}
zh_cn: 无法删除课程：{0}

# ProjectNameRequired
source: A project name is required.
zh_cn: 必须填写项目名称。

# ProjectSaveError
source: The project could not be saved: {0}
zh_cn: 无法保存项目：{0}

# ProjectDeleteError
source: The project could not be deleted: {0}
zh_cn: 无法删除项目：{0}

# TagNameRequired
source: A tag name is required.
zh_cn: 必须填写标签名称。

# TagSaveError
source: The tag could not be saved: {0}
zh_cn: 无法保存标签：{0}

# TagDeleteError
source: The tag could not be deleted: {0}
zh_cn: 无法删除标签：{0}

# NavigationStyleButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Use compact navigation
zh_cn: 使用紧凑导航

# SearchToggleButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Search assignments
zh_cn: 搜索作业

# SearchToggleButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Search assignments
zh_cn: 搜索作业

# SearchBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Search assignments
zh_cn: 搜索作业

# SearchCloseButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Clear and close search
zh_cn: 清除并关闭搜索

# SearchCloseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Clear and close search
zh_cn: 清除并关闭搜索

# ClearFiltersButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Clear filters
zh_cn: 清除筛选条件

# AssignmentList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Assignments
zh_cn: 作业列表

# DeleteAssignmentButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Delete assignment
zh_cn: 删除作业

source: Delete assignment
zh_cn: 删除作业

# LoginModeBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Login mode
zh_cn: 登录模式

# BrowserBackButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Back
zh_cn: 后退

# BrowserBackButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Go back
zh_cn: 后退

# BrowserForwardButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Forward
zh_cn: 前进

source: Go forward
zh_cn: 前进

# BrowserReloadButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Reload
zh_cn: 重新加载

source: Reload page
zh_cn: 重新加载页面

# AddressBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Source address
zh_cn: 来源地址

# SourceBrowser.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Source browser
zh_cn: 来源浏览器

source: Send a test reminder in five seconds
zh_cn: 五秒后发送测试提醒

source: Add subtask
zh_cn: 添加子任务

# EditorReminderDate.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Reminder date
zh_cn: 提醒日期

# EditorReminderTime.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Reminder time
zh_cn: 提醒时间

# CoursesList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Courses
zh_cn: 课程列表

# ProjectsList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Projects
zh_cn: 项目列表

# TagsList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Tags
zh_cn: 标签列表

# SaveCourseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Save course
zh_cn: 保存课程

# NewCourseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: New course
zh_cn: 新建课程

# DeleteCourseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Delete course
zh_cn: 删除课程

# SaveProjectButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Save project
zh_cn: 保存项目

# NewProjectButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: New project
zh_cn: 新建项目

source: Delete project
zh_cn: 删除项目

# SaveTagButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Save tag
zh_cn: 保存标签
